const axios = require("axios");
const request = require("request");
const fs = require("fs-extra");
const moment = require("moment-timezone");

module.exports.config = {
  name: "murgi100",
  version: "2.0.0",
  hasPermssion: 0,
  credits: "🔰𝗥𝗮𝗵𝗮𝘁_𝗕𝗼𝘀𝘀🔰",
  description: "Show murgi",
  commandCategory: "info",
  usages: "murgi100 @mention",
  cooldowns: 2
};

module.exports.run = async function({ api, event }) {
  const threadID = event.threadID;
  const mentions = Object.keys(event.mentions || {});

  if (mentions.length === 0) {
    return api.sendMessage("𝗥𝗮𝗵𝗮𝘁_𝗕𝗼𝘀𝘀 কাকে চুদতে চাও😑একবার শুধু mention করো💩ওর চৌদ্দ গুষ্টি চুদে দিব🙂", threadID);
  }

  const targetID = mentions[0];
  const targetName = event.mentions[targetID];

  if (!global.clientIntervals) global.clientIntervals = {};

  if (global.clientIntervals[threadID]) {
    return api.sendMessage("𝗥𝗮𝗵𝗮𝘁_𝗕𝗼𝘀𝘀 না থামতে বললে থামবো না🫵🏻😎চুদতেই থাকবো", threadID);
  }

  const messages = [
    `🫵🏻চুদা শুরু করলাম পারলে আটকা🫵🏻`,
      `${targetName}, খাংকির পোলা তর মারে চুদি 🤣🫦 `,
      `${targetName}, তোর মায়ের পমপম টিপমু 🫦`,
      `${targetName}, রাহাদ তোর কচি বোনের ভোদায় আঙ্গুল ঢুকিয়ে ঘুমাবো 💋`,
      `${targetName}, তোর মায়ের কচি ভুদায় কামুর দিমু 🫢🤣 `,
      `${targetName}, তোকে চুদে তোর চৌদ্দ গুষ্টি বের করছে💦 `,
      `${targetName}, খানকির পোলা , মাদার চোদ , চুদ মারানি 💋 `,
      `${targetName}, Rahat বস কী আর চুদবে 🫦 আমার কাছেই তো টিকতে পারবি না 🫦`,
      `${targetName}, তোর সাওয়া দিয়া Rahat গাছ ডুকাবো💦 `,
      `${targetName}, তোকে ডগি স্টাইলে খেলমু 🫦💦 `,
      `${targetName}, তোর মুখের মধ্যে হেন্ডেল মারমু 💋💋 `,
      `${targetName}, বাতিজা শুন তর আম্মু রে চুদলে রাগ করবি না তো ✋🫢🐸 `,
      `${targetName}, হাই মাদারচোদ তর জাতের আম্মু রে চুদি `,
      `${targetName}, ~ চুদা কি আরো খাবি মাগির পোলা 🤖`,
      `${targetName}, খাংকির পোলা  `,
      `${targetName}, মাদারচোদ এর পোলা  `,
      `${targetName}, ব্যাস্যার পোলা 🐰 `,
      `${targetName}, ব্যাশ্যা মাগির পোলা 💋🖕🏿`,
      `${targetName}, পতিতা মাগির পোলা `,
      `${targetName}, তর মারে চুদি `,
      `${targetName}, নাট বল্টু মাগির পোলা 🤟 `,
      `${targetName}, তর বোন রে পায়জামা খুলে চুদি 🤣 `,
      `${targetName}, উম্মম্মা তর বোন এর কচি ভুদায় 💉 `,
      `${targetName}, DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম `,
      `${targetName}, কামলা মাগির পোলা ✋ `,
      `${targetName}, বাস্ট্রাড এর বাচ্চা বস্তির পোলা `,
      `${targetName}, রাহাদের জারজ সন্তান 🤖`,
      `${targetName}, তোর পাছায় বাঁশ দিমু 🫦`,
      `${targetName}, তর কচি বোন এর পম পম টিপমু 🫦`,
      `${targetName}, ব্যাস্যার পোলা কথা শুন তর আম্মু রে গামছা পেচিয়ে চুদি 🐰 `,
      `${targetName}, রাহাদ তোকে পুটকি মারবো🤣 `,
      `${targetName}, ২০ টাকা এ পতিতা মাগির পোলা `,
      `${targetName}, বস্তির ছেলে অনলাইনের কিং `,
      `${targetName}, টুকাই মাগির পোলা 🤟 `,
      `${targetName}, তর আম্মু রে পায়জামা খুলে চুদি 🤣 `,
      `${targetName}, হিজলা মাগির পোলা ✋ `,
      `${targetName}, Welcome শুয়োরের বাচ্চা 🫵🫩`,
      `${targetName}, কুত্তার বাচ্চা তর কচি বোন এর পম পম 😍 `,
      `${targetName}, তোর বাপে তোর নানা 🤬 `,
      `${targetName}, বস্তির ছেলে তোর বইনরে মুসলমানি দিমু `,
      `${targetName}, টুকাই মাগির পোলা মোবাইল ভাইব্রেশন কইরা তর বোন এর পুকটিতে ভরবো 🤟 `,
      `${targetName}, তোর মুখে হাইগ্যা দিমু 🤣 `,
      `${targetName}, কুত্তার পুকটি চাটামু 💉 `,
      `${targetName}, তর আম্মুর হোগা দিয়া ট্রেন ভইরা দিমু `,
      `${targetName}, হিজলা মাগির পোলা হাতির ল্যাওড়া দিয়া চুদুম ✋ `,
      `${targetName}, তর বোন ভোদা ছিল্লা লবণ লাগায় দিমু `,
      `${targetName}, তাও যদি না চুদা হয় তাহলে প্যান খুলে দাড়া 🫦 রাহাদ বস আসতেছে💋💦`,
`${targetName}, ‎কামলা মাগির পোলা  ✋🤣`,
`${targetName}, তোর ভুদায় মরিচ বেটে লাগিয়ে রাখবো🤣🙏🏻`,
`${targetName}, তোর আম্মুর কালো ভুদায় হাত দিয়ে বসে আছি 😌🤣🙏🏻`,
`${targetName}, রাহাদ বস  তোর মুখের মধ্যে নুনু ঢুকিয়ে রাখবো`,
`${targetName}, দুই পা তোলা করে চুদতে ভালো লাগে 😌তুই এই আশাটা পূরন করবি 🙏🏻🫵🏻`,
`${targetName}, রাহাদ বস তোকে ডগি স্টাইলে চুদবো🤣🐸`,
`${targetName}, খানকির পোলা গ্রুপ থেকে বের হব🫵🏻🤣`,
`${targetName}, রাহাদের ফাটা কন্ডমের ফসল 🫵🏻🤣`,
`${targetName}, রাহাদ বস তোর বোনকে দুই পা কাধে নিয়ে চুদছে 😌একটু তোর বোনকে সাবধানে রাখিস পরের বার কিন্তু আরো বড়ো ধামাকা হবো😌🫵🏻🐸`,
`${targetName}, রাহাদ বস তোর বোনকে দুই পা কাধে নিয়ে চুদছে 😌একটু তোর বোনকে সাবধানে রাখিস পরের বার কিন্তু আরো বড়ো ধামাকা হবো😌🫵🏻🐸`,
`${targetName}, রাহাদ বস তোর বোনকে দুই পা কাধে নিয়ে চুদছে 😌একটু তোর বোনকে সাবধানে রাখিস পরের বার কিন্তু আরো বড়ো ধামাকা হবো😌🫵🏻🐸`,
`${targetName}, রাহাদ বস তোকে দুই পা কাধে নিয়ে করবো🫵🏻`,
`${targetName}, রাহাদ বস তোকে দুই পা কাধে নিয়ে করবো🫵🏻`,
`${targetName}, রাহাদ বস তোকে দুই পা কাধে নিয়ে করবো🫵🏻`,
`${targetName}, অনলাইনে ভিডিও কলে কতো টাকা আয় করস 🐸👄`,
`${targetName}, ‎কুত্তার বাচ্ছা তর বৌন ভোদায় মাগুর মাছ চাষ করুম💋`,
`${targetName}, ‎‎তোর মার ভোদা  চুইদা ➖ তোর বোনের ভোদায় ভরমু এক বালতি বিযরা ➖বিযরা  রং  হয় সাদা ➖তোর মার ভোদা চুইদা বানামু ভারচুয়াল জগতের  গাধা💋👄`,
`${targetName}, ‎‎তোর মায়ের ভোদার শয়তানের কসম 😌😌😌👄`,
`${targetName}, ‎‎গাড়ির মধ্যে আছে নাকি তোর বাপ তোর মায়ের  চুদার সময় দিমু বড় বড় ঠাপ🖕🏿🖕🏿🖕🏿🖕🏿💦💨💨💦💦 `,
`${targetName}, ‎‎তোর বাপের নাম নাকি রাহাদ তোর মায়ের চুইদা করমু বিয়া,,বিয়াতে কি মজা তোর মার ভোদায়  দিমু এক পোটলা গাজা,,গাজা খাইয়া হবি তুই টাল,,তোর মার ভোদায়  ফেলমু  এক বালতি মাল,,মাল যদি হয় মিষ্টি--- তোর মত আরেকটা  জারজ পোলা করমু অনলাইনে  সৃষ্টি💋🫵🏻💦`,
`${targetName}, ‎ হাই মাদারচোদ তর তর ব্যাশা জাতের আম্মু টা রে আদর করে করে রাহাদ বস চুদে💋👄💦🫵🏻`,
`${targetName}, ‎ হাই মাদারচোদ তর তর ব্যাশা জাতের আম্মু টা রে আদর করে করে রাহাদ বস চুদে💋👄💦🫵🏻`,
`${targetName}, ‎ হাই মাদারচোদ তর তর ব্যাশা জাতের আম্মু টা রে আদর করে করে রাহাদ বস চুদে💋👄💦🫵🏻`,
`${targetName}, ‎‎তর বোন রে পায়জামা খুলে Rahat boss চুদে`,
`${targetName}, ‎Rahat boss মোবাইল ভাইব্রেশন কইরা তুর পুকটিতে ভরবো🤣🤣`,
`${targetName}, ‎শরম ছাড়া খানকির পোলা`,
`${targetName}, ‎Rahat boss মোবাইল ভাইব্রেশন কইরা তুর পুকটিতে ভরবো🤣🤣`,
`${targetName}, ‎Rahat boss মোবাইল ভাইব্রেশন কইরা তুর পুকটিতে ভরবো🤣🤣`,
`${targetName}, ‎ তর মায়ের ভোদা শিরিষ কাগজ দিয়া ঘইষা দিমু💩🫦`,
`${targetName}, ‎ভুস্কি মাগির পোলা`,
`${targetName}, ‎টোকাই 🤣 সারাদিন মোবাইলে জুয়া খেলে রাতে নিজের বোনকে লাগাতে যাস খানকির পোলা💩😁`,
`${targetName}, ‎এতো কিছু বলতেছি তাও শরম নাই 🤣`,
`${targetName}, ‎টোকাই 🤣 সারাদিন মোবাইলে জুয়া খেলে রাতে নিজের বোনকে লাগাতে যাস খানকির পোলা💩😁`,
`${targetName}, ‎টোকাই 🤣 সারাদিন মোবাইলে জুয়া খেলে রাতে নিজের বোনকে লাগাতে যাস খানকির পোলা💩😁`,
`${targetName}, ‎শালা নিজের বোনকে নিজেই চুদে 💩🤣`,
`${targetName}, ‎আরো কোন দিন লাগতে আসিস Rahat Boss পাছায় বট গাছ ঢুকিয়ে দিবো🫦🫩🫩`,
`${targetName}, ‎আরো কোন দিন লাগতে আসিস Rahat Boss পাছায় বট গাছ ঢুকিয়ে দিবো🫦🫩🫩`,
`${targetName}, ‎আরো কোন দিন লাগতে আসিস Rahat Boss পাছায় বট গাছ ঢুকিয়ে দিবো🫦🫩🫩`,
`${targetName}, ‎তোর বোনের দুই দুধ টিপে রাহাদ বস শান্তি পাইছে 🫦🐸`,
`${targetName}, ‎তোর বোনের দুই দুধ টিপে রাহাদ বস শান্তি পাইছে 🫦🐸`,
`${targetName}, ‎তোর কাইল্লা পাছায় সিরিজ কাগজ দিয়ে ঘসে সাদা বানাবো🤣🤣`,
`${targetName}, ‎তোর কাইল্লা পাছায় সিরিজ কাগজ দিয়ে ঘসে সাদা বানাবো🤣🤣`,
`${targetName}, ‎হেন্ডেল মাইরা মুখের মধ্যে দিয়ে ভিডিও বানামু 🫦🫦`,
`${targetName}, ‎Rahat boss এর চামচা 💩শালা `,
`${targetName}, ‎Rahat boss তোকে দিনে কতোবার চুদে রে 💩🫦🤣🤣`,
`${targetName}, ‎Rahat boss এর কামলা খানকির পোলা🫵🏻🖕🏿`,
`${targetName}, ‎তোর মায়ের দুই দুধ চেটে খাবো🌚🤤`,
`${targetName}, ‎তোর ভোদায় Rahat boss মাগুর মাছ চাষ করবো 🖕🏿🤣🫵🏻`,
`${targetName}, ‎🥵আরে নাউজুবিল্লা করলাম শুরু তোর মার পুটকিতে ডুকামু ২টা গরু।।। গরুনাকি ডাকে হাম্বা  তোর মার ভোদায় ডুকামু ২টা ইলেক্ট্রিকের খাম্বা ---খাম্বা হয় শক্ত তোর মার বোদা চুইদা বার করমু রক্ত ---রক্তের রং যদি হয় লাল তোর  মারে  চুদবো  চিরকাল ❎🖕🏿💦`,
`${targetName}, ‎তুমি আমার জীবনের প্রিয়তমা চুদে করবো হারাধোনা 😻🦆`,
`${targetName}, ‎‎আরে চুদানী বুদানী  মাগীর পোলা তুই নাকি অনলাইনে  করিস পাতালি ---তোর মার  ভোদা ছিড়া দিমু জোরা তালি,,,❎❎❎❎ `,
`${targetName}, ‎তোর মায়ের চুদতে চুদতে নিয়া যামু তুর্কী,,তুর্কীকে আছে নাকি তোর মামু,,তোর বোনের কচি ভোদা আমি কামরাই কামরাই খামু ❎ `,
`${targetName}, ‎একদিন তোর মাকে শপিং করাৃোর লোভ দেখিয়ে,, রাস্তার এক চিপা গলি দিয়ে নিয়ে গিয়ে আচ্ছা রকম করে চুদেছিলাম 💦🥵`,
`${targetName}, ‎আকাশ চুদিলাম,, বাতাস চুদিলাম,,চুদিলাম কুয়ের খাল,, কত বড় বড় রেন্ডি চুদিলাম তুই কোন পুটকির বাল🐸🦆🤣`,
`${targetName}, ‎তোর মাকে তো দেখলাম কত লোকেই না শকলেটের লোভ দেখিয়ে দেখিয়ে চুদতেছে, 😓🥹🤣`,
`${targetName}, ‎‎তোর সাথে  দিলাম আড়ি--- তোর মায়েরে চুদতে চুদতে লইয়া  যামু নানার বাড়ি,,তোর নানায় একটা পাগল  তোর মায়েরে চুদে  রাম ছাগল,,ছাগলের আছে নাকি  পশম,,তোর মায়ের ভোদার শয়তানের কসম ❎❎❎❎`,
`${targetName}, ‎তোর মার হেডার চলা ছুটাইয়া থামবো আমি 🤠`,
`${targetName}, ‎‎তুই নাকি অনলাইনের কিং তোর মার ভোদায় মধ্যে বাজামু সাপের বিন,, সাপের বিনের তালে তালে তোর মায়রে চুদমু আমি  খালে বিলে,-----খালে  নাই সাপ আমি তোর অবৈধ বাপ--- শুয়ারের বাচ্চা❎❎❎❎`,
`${targetName}, ‎কিরে বাইনচোদ বোকাচোদা তোর বোন তো দেখলাম সেই মাল,, তা তোর বোনকে কি ২০ টাকার বিনিময়ে চুদতে দিবি,🦆🤣🤐`,
`${targetName}, ‎‎তর মায়ের ভোদা বোম্বাই মরিচ দিয়া চুদামু।💔 `,
`${targetName}, ‎‎বাতিজা শুন তর আম্মু রে চুদলে রাগ করবি না তো আচ্ছা জা রাগ করিস না তর আম্মুর কালা ভুদায় আর চুদলাম না তো বোন এর জামা টা খুলে দে ✋`,
`${targetName}, ‎তোর মার সাথে কাটানো সময় গুলা খুব মনে পড়ে যখন শুধু সাত বেলা চুদতাম আমি🥹😓`,
`${targetName}, ‎খানকির পোলা তোর যদি এতই হেডায় দম থাকে তাহলে আয় তোর হেডা ফাটিয়ে সেই দম বার করে দি 🤣🤣`,
`${targetName}, ‎তোর মাকে আমার ধোন চোষার লোভ দেখিয়ে চুদেছিলাম তোর মনে নাই🥴😪`,
`${targetName}, ‎খানকির পোলা তোর যদি এতই হেডায় দম থাকে তাহলে আয় তোর হেডা ফাটিয়ে সেই দম বার করে দি 🤣🤣`,
`${targetName}, ‎তোর মার ভোদায় রাসিয়ান পারোমানবিক ১৫টন মিসাইল ঢুকিয়ে চুদি🥵`,
`${targetName}, ‎তোর মার সাথে বসে tom an jerry কার্টুন দেখতে দেখতে চুদছিলাম 😓☠️💋`,
`${targetName}, ‎কিরে সালা কন্ডম চোর মাগি কথা বলিস না কেন 😂🥴`,
`${targetName}, ‎কিরে সালা কন্ডম চোর মাগি কথা বলিস না কেন 😂🥴`,
`${targetName}, ‎কিরে সালা কন্ডম চোর মাগি কথা বলিস না কেন 😂🥴`,
`${targetName}, ‎কিরে সালা কন্ডম চোর মাগি কথা বলিস না কেন 😂🥴`,
`${targetName}, ‎কিরে সালা কন্ডম চোর মাগি কথা বলিস না কেন 😂🥴`,
`${targetName}, ‎এই বোকাচোদা,, খানকি মাগি রেন্ডি মাগি ভুদার বাল গুদের ছাল,,, ঠুঙ্গাচোদা বেশ্যামাগি,, পারলে তোর মার ভোদায় সরিসার তেল লাগিয়ে বসে থাক,, আমি এসে চুদে যাবো😂😂👌😓`,
`${targetName}, ‎তোর হেডার ঝাল আজ মিটিয়ে দিবো সাউয়া মারানির পোলা 😓😓`,
`${targetName}, ‎কিরে মাগি ভোদার কথা বলস,, বেশি পক পক করলে তোর মার মতো তোকেও চুদে লাল করে দিবো💦🥵☠️`,
`${targetName}, ‎Rahat boss তোর চৌদ্দ গুষ্টি চুদে 💩🖕🏿💋`,
`${targetName}, ‎Rahat boss তোর চৌদ্দ গুষ্টি চুদে 💩🖕🏿💋`,
`${targetName}, ‎Rahat boss তোর চৌদ্দ গুষ্টি চুদে 💩🖕🏿💋`,
`${targetName}, ‎Rahat boss তোর চৌদ্দ গুষ্টি চুদে 💩🖕🏿💋`,
`${targetName}, ‎Rahat boss তোর চৌদ্দ গুষ্টি চুদে 💩🖕🏿💋`,
`${targetName}, ‎Rahat boss তোর চৌদ্দ গুষ্টি চুদে 💩🖕🏿💋`,
`${targetName}, ‎ভোদার বাল তুই যদি গালি দেস তাহলে তোর নার ভোদা ফাটিয়ে দিবো☠️😡`,
`${targetName}, ‎ভোদার বাল তুই যদি গালি দেস তাহলে তোর নার ভোদা ফাটিয়ে দিবো☠️😡`,
`${targetName}, ‎তোর কচি বোনের ভুদায় Rahat boss কামড় দিবো💋🫵🏻💦`,
`${targetName}, ‎তোর কচি বোনের ভুদায় Rahat boss কামড় দিবো💋🫵🏻💦`,
`${targetName}, ‎‎জং ধরা লোহা দিয়া পাকিস্তানের মানচিত্র বানাই্য়া তোদের পিছন দিয়া ঢুকামু🤬`,
`${targetName}, ‎‎বান্দির পোলা তর কচি বোনের ভুদা ফাক কর থুতু দিয়ে ভুদায় দন ডুকামু 🤟`
  ];

  // 🔥 লোডিং এনিমেশন
  api.sendMessage("▒▒▒▒▒▒▒▒▒▒ 0%", threadID, (err, info) => {
    if (err) return console.error(err);
    const progressMsgID = info.messageID;

    let step = 0;
    const interval = 120; // স্পিডি

    const progressInterval = setInterval(() => {
      step += 1;
      if (step > 10) {
        clearInterval(progressInterval);

        // সবশেষে মেসেজ ডিলিট + মূল প্রসেস চালু
        setTimeout(async () => {
          api.unsendMessage(progressMsgID);

          let idx = 0;
          await api.sendMessage(
            { body: messages[idx], mentions: [{ tag: targetName, id: targetID }] },
            threadID
          );

          const intervalId = setInterval(() => {
            idx = (idx + 1) % messages.length;
            api.sendMessage(
              { body: messages[idx], mentions: [{ tag: targetName, id: targetID }] },
              threadID
            );
          }, 3000); // এখন ৩ সেকেন্ডে মেসেজ যাবে

          global.clientIntervals[threadID] = intervalId;

        }, 500);
        return;
      }

      const filled = "█".repeat(step);
      const empty = "▒".repeat(10 - step);
      const percent = step * 10;
      api.editMessage(`${filled}${empty} ${percent}%`, progressMsgID, threadID);

    }, interval);
  });
};

// Stop command (ভুলে গেলে বন্ধ করার জন্য)
module.exports.stop = async function({ api, event }) {
  const threadID = event.threadID;

  if (global.clientIntervals && global.clientIntervals[threadID]) {
    clearInterval(global.clientIntervals[threadID]);
    delete global.clientIntervals[threadID];
    return api.sendMessage("রিপিট বন্ধ করা হয়েছে 🐸", threadID);
  } else {
    return api.sendMessage("এই চ্যাটে কোনো রিপিট চলছে না।", threadID);
  }
};
